---
title: WallSweepInfo
classe: Autodesk.Revit.DB.WallSweepInfo
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 18
---

# WallSweepInfo

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean CutsWall { get; set; }` | `wallSweepInfo.CutsWall` | Boolean |
| `Double DefaultSetback { get; set; }` | `wallSweepInfo.DefaultSetback` | Double |
| `Double Distance { get; set; }` | `wallSweepInfo.Distance` | Double |
| `DistanceMeasuredFrom DistanceMeasuredFrom { get; set; }` | `wallSweepInfo.DistanceMeasuredFrom` | DistanceMeasuredFrom |
| `Int32 Id { get; set; }` | `wallSweepInfo.Id` | Int32 |
| `Boolean IsCutByInserts { get; set; }` | `wallSweepInfo.IsCutByInserts` | Boolean |
| `Boolean IsFixed { get; }` | `wallSweepInfo.IsFixed` | Boolean |
| `Boolean IsProfileFlipped { get; set; }` | `wallSweepInfo.IsProfileFlipped` | Boolean |
| `Boolean IsValidObject { get; }` | `wallSweepInfo.IsValidObject` | Boolean |
| `Boolean IsVertical { get; }` | `wallSweepInfo.IsVertical` | Boolean |
| `ElementId MaterialId { get; set; }` | `wallSweepInfo.MaterialId` | ElementId |
| `ElementId ProfileId { get; set; }` | `wallSweepInfo.ProfileId` | ElementId |
| `Double WallOffset { get; set; }` | `wallSweepInfo.WallOffset` | Double |
| `WallSide WallSide { get; set; }` | `wallSweepInfo.WallSide` | WallSide |
| `WallSweepOrientation WallSweepOrientation { get; set; }` | `wallSweepInfo.WallSweepOrientation` | WallSweepOrientation |
| `WallSweepType WallSweepType { get; set; }` | `wallSweepInfo.WallSweepType` | WallSweepType |
| `Void Dispose()` | `wallSweepInfo.Dispose()` | Void |
| `Boolean IsEqual(WallSweepInfo)` | `wallSweepInfo.IsEqual(toCompare)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```